sage: p = 1030117089346152397992199666095118281879287986536825247118586511791174
....: 48866944643710256992871651676356472127683739539596571794490321460848284321
....: 48029998665341211535782389315820337776703870583
....:
sage: z = Integers(p)
sage: z
Ring of integers modulo 10301170893461523979921996660951182818792879865368252471185865117911744886694464371025699287165167635647212768373953959657179449032146084828432148029998665341211535782389315820337776703870583
sage: g = z(2)
sage: h = z(29475413207652927406234068711782665823814501746099455217618753984808
....: 98850402707688185229367599063319234406064611016882089187825018272392085364
....: 819278499882215616201571116912715958191762192699)
sage: h
2947541320765292740623406871178266582381450174609945521761875398480898850402707688185229367599063319234406064611016882089187825018272392085364819278499882215616201571116912715958191762192699
sage: x = h.log(g)
sage: x
151187977724481794013913355657075436696362499273341
sage: 
--------------------

x.to_bytes(30, 'big')

b'\x00\x00\x00\x00\x00\x00\x00\x00\x00grodno{s4g3_1s_p0wer}'

